import './Overview.css'

export default function Overview() {
  return (
    <section className="course-overview tab-content tab-content--active">
      <h4 className="course-overview__title">با دوره بیشتر آشنا بشید.</h4>
      <div className="course-overview__description">
        <p>
          دوره "برنامه‌نویسی با متلب" یک تجربه یادگیری جذاب و مفید برای همه
          علاقه‌مندان به مهندسی و علوم کامپیوتر است. در این دوره، شما با یادگیری
          زبان برنامه‌نویسی متلب، ابزاری قدرتمند برای حل مسائل علمی و مهندسی، به
          توانایی توسعه و اجرای کدهای علمی می‌پردازید.
        </p>
        <p>
          در این دوره، ما از مبتدی تا پیشرفته، تمام جنبه‌های برنامه‌نویسی با
          متلب را پوشش می‌دهیم. شما با مفاهیم پایه‌ای متلب آشنا می‌شوید و سپس به
          توسعه برنامه‌های پیچیده و حل مسائل واقعی با استفاده از متلب
          می‌پردازید.
        </p>
        <p>
          این دوره شما را با قدرت‌های ویژه متلب برای تحلیل داده، مدل‌سازی، و حل
          مسائل علمی و مهندسی آشنا می‌کند. بعلاوه، شما خواهید آموخت چگونه
          داده‌ها را به زبانی تصویری و گرافیکی نمایش دهید تا نتایج تحلیل‌های خود
          را به راحتی به دیگران ارائه دهید.
        </p>
      </div>
      <video className="course-overview__video" controls>
        <source
          src="src/assets/videos/course/video (720p).mp4"
          type="video/mp4"
        />
      </video>
      <h5 className="course-overview__title">
        چه جیز هایی در این دوره یاد می گیرید؟
      </h5>
      <ul className="course-overview__menu">
        <li>برنامه نویسی متلب</li>
        <li>مدل سازی و شبیه سازی</li>
        <li>نمایش داده ها</li>
        <li>آشنایی با متلب</li>
        <li>پروژه های عملی</li>
      </ul>

      <h4 className="course-overview__title">مدرک پایان دروه</h4>
      <div className="course-overview__description">
        <p>
          در طی این دوره، شما با مفاهیم پایه و پیشرفته برنامه‌نویسی با متلب آشنا
          شده و توانسته‌اید کدهای علمی و مهندسی پیچیده را توسعه دهید، داده‌ها را
          تحلیل کرده و نتایج خود را به زبانی گرافیکی نمایش دهید. این دوره شما را
          به یک برنامه‌نویس ماهر و مسلط به این ابزار قدرتمند تبدیل کرده است.
        </p>
      </div>
    </section>
  );
}
